[
  {
    "id": "1",
    "brand": "Toyota",
    "model": "Fortuner",
    "price": 3600000,
    "fuelType": "Diesel",
    "seatingCapacity": 7,
    "image": "https://gaadiwaadi.com/wp-content/uploads/2024/04/2024-toyota-fortuner-mild-hybrid-1.jpg",
    "description": "Launched in 2024, the Toyota Fortuner is a powerful and rugged SUV that epitomizes adventure. Its bold exterior is complemented by a spacious and luxurious interior, designed with high-quality materials. The Fortuner is equipped with cutting-edge safety features, including multiple airbags and advanced stability control, ensuring peace of mind on every journey. With a robust diesel engine that delivers exceptional performance both on highways and off-road trails, it stands out as the perfect choice for families and adventure seekers alike. Whether navigating urban roads or exploring rugged terrains, the Fortuner guarantees comfort and reliability.",
    "specifications": ["Diesel Engine", "7-Seater", "Automatic Transmission", "Touchscreen Display", "Dual Airbags"]
  },
  {
    "id": "2",
    "brand": "Hyundai",
    "model": "Creta",
    "price": 2100000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKPCmfSgI0wWohvhPDlqRb50PkdQfAo965BA&s",
    "description": "Introduced in 2020, the Hyundai Creta is a stylish and feature-packed compact SUV tailored for urban driving. Its modern design features sleek lines and a bold front grille, making it a head-turner on the streets. Inside, the Creta offers a spacious cabin with high-tech features, including a touchscreen infotainment system and advanced connectivity options. Safety is paramount, with multiple airbags and a robust chassis design. The Creta excels in providing a comfortable ride for city commutes and longer journeys, making it the ideal vehicle for young professionals and families seeking both style and practicality.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Sunroof", "Rear Parking Sensors"]
  },
  {
    "id": "3",
    "brand": "Tata",
    "model": "Harrier",
    "price": 2800000,
    "fuelType": "Diesel",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT-j6L_2XgNdUlBtG6BWS_BBGigYkkNY_oNOA&s",
    "description": "Launched in 2019, the Tata Harrier is a bold and robust SUV that merges style with performance. Its striking design features a commanding presence on the road, while the well-appointed interior offers ample space and comfort for all passengers. The Harrier comes equipped with advanced safety technologies, including multiple airbags and electronic stability control, ensuring a secure driving experience. With a powerful diesel engine that delivers impressive performance, it is perfect for both city driving and weekend getaways, making it an excellent choice for families and adventure enthusiasts alike.",
    "specifications": ["Diesel Engine", "5-Seater", "Automatic Transmission", "Panoramic Sunroof", "6 Airbags"]
  },
  {
    "id": "4",
    "brand": "Maruti",
    "model": "Swift",
    "price": 850000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTdP6EuJs7ka27ncdABn43IYFWmi4_fb6QHBg&s",
    "description": "The Maruti Swift, launched in 2021, is a compact hatchback celebrated for its sporty design and exceptional fuel efficiency. Its dynamic exterior is paired with a comfortable interior that includes modern features such as a touchscreen infotainment system. The Swift prioritizes safety with dual airbags and ABS, making it a reliable choice for city driving. With a peppy engine and agile handling, the Swift is not only fun to drive but also practical for daily commutes, appealing to young professionals and small families alike.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Smartplay Studio", "Dual Airbags"]
  },
  {
    "id": "5",
    "brand": "Mahindra",
    "model": "XUV700",
    "price": 3500000,
    "fuelType": "Diesel",
    "seatingCapacity": 7,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR37l8JL2mB7kdifAKb3IQ3j_asjX6qVcDY1A&s",
    "description": "Launched in 2021, the Mahindra XUV700 is a premium SUV that redefines comfort and technology. Its striking design features a bold front fascia and spacious interiors equipped with cutting-edge technology, including a large touchscreen interface. The XUV700 prioritizes safety with advanced features like ADAS and multiple airbags. With a powerful diesel engine that offers both performance and efficiency, it is perfect for family road trips and city driving, ensuring an exhilarating experience for all passengers.",
    "specifications": ["Diesel Engine", "7-Seater", "Automatic Transmission", "ADAS Features", "Panoramic Sunroof"]
  },
  {
    "id": "6",
    "brand": "Kia",
    "model": "Seltos",
    "price": 1900000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTPK-8u7hnL_UdalNPjmom4J9S-KsufuIiTpQ&s",
    "description": "The Kia Seltos, introduced in 2019, is a stylish compact SUV that balances performance and comfort. Its eye-catching design features a bold stance and high-quality interiors, equipped with modern technology that enhances the driving experience. Safety is a key focus, with multiple airbags and advanced driver assistance systems. The Seltos is ideal for urban drivers who seek both style and functionality, making it a top choice for daily commutes and weekend adventures.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "6 Airbags"]
  },
  {
    "id": "7",
    "brand": "Honda",
    "model": "City",
    "price": 1700000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTop9hIJKsWm49hiHIhDWNfRkYmn6sQC_vlJg&s",
    "description": "Launched in 2020, the Honda City is a premium sedan known for its elegance and performance. Its sophisticated design features smooth lines and a spacious cabin filled with high-end features such as a touchscreen infotainment system. The City excels in safety with multiple airbags and advanced braking systems. With its smooth handling and efficient engine, it is perfect for those who appreciate a refined driving experience in both urban and highway settings.",
    "specifications": ["Petrol Engine", "5-Seater", "CVT Transmission", "Sunroof", "Multi-Function Steering Wheel"]
  },
  {
    "id": "8",
    "brand": "MG",
    "model": "Hector",
    "price": 2500000,
    "fuelType": "Diesel",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQM6CbWlZIH1RZ1WgPKhV-zjGit-oPTdy_8wA&s",
    "description": "The MG Hector, launched in 2019, is a spacious SUV packed with advanced technology and features. Its modern design and roomy interiors offer comfort for families and tech-savvy individuals alike. Equipped with a powerful diesel engine, the Hector ensures performance and efficiency, while safety features like multiple airbags provide peace of mind. The Hector is perfect for those seeking a versatile vehicle for both city driving and family road trips.",
    "specifications": ["Diesel Engine", "5-Seater", "Manual/Automatic Transmission", "10.4-inch Touchscreen", "Voice Assistant"]
  },
  {
    "id": "9",
    "brand": "Skoda",
    "model": "Kushaq",
    "price": 1900000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSLwgwrKZAl5wiFOZaerE6TcVyT5Xiftp6ymw&s",
    "description": "Launched in 2021, the Skoda Kushaq is a compact SUV that blends practicality with a stylish design. Its spacious cabin is equipped with modern amenities, making it ideal for both city and highway driving. The Kushaq prioritizes safety with advanced features and multiple airbags. With its robust performance and efficient engine, it stands out as a reliable choice for urban dwellers and families seeking comfort and versatility.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Virtual Cockpit", "6 Airbags"]
  },
  {
    "id": "10",
    "brand": "Volkswagen",
    "model": "Virtus",
    "price": 1900000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhcoFgWmTgpmxJl8nwzWX2rT4P5iHVIUC6og&s",
    "description": "The Volkswagen Virtus, launched in 2022, is a premium sedan that seamlessly blends performance with comfort. Its sleek design and high-quality interiors are tailored for those who appreciate elegance. The Virtus is equipped with advanced technology and safety features, including multiple airbags and stability control. With its efficient engine and smooth handling, it is perfect for both city driving and long-distance travel, ensuring a secure and enjoyable ride.",
    "specifications": ["Petrol Engine", "5-Seater", "Automatic Transmission", "Digital Cockpit", "6 Airbags"]
  },
  {
    "id": "11",
    "brand": "Maruti",
    "model": "Baleno",
    "price": 1100000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://www.team-bhp.com/sites/default/files/styles/amp_high_res/public/in.jpg",
    "description": "Launched in 2022, the Maruti Baleno is a premium hatchback known for its spacious interiors and fuel efficiency. Its stylish exterior is complemented by a comfortable and feature-rich interior, making it ideal for daily commutes and longer trips. The Baleno prioritizes safety with multiple airbags and modern safety features. With its efficient engine and smooth handling, it is a favorite among budget-conscious buyers seeking both style and practicality.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "Dual Airbags"]
  },
  {
    "id": "12",
    "brand": "Renault",
    "model": "Kiger",
    "price": 950000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://stimg.cardekho.com/images/carexteriorimages/930x620/Renault/Kiger/10042/1717592388399/front-left-side-47.jpg",
    "description": "The Renault Kiger, launched in 2021, is a compact SUV that offers modern features and a stylish design. Its compact size is perfect for urban drivers, providing a comfortable and efficient driving experience. The Kiger is equipped with advanced safety features, including multiple airbags, ensuring peace of mind on the road. With its efficient engine and agile handling, it excels in navigating through city traffic, making it an ideal choice for those who prioritize convenience and style.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "Dual Airbags"]
  },
  {
    "id": "13",
    "brand": "Mahindra",
    "model": "Thar",
    "price": 2100000,
    "fuelType": "Diesel",
    "seatingCapacity": 4,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcReoL1mNWnC1kSH7k5MgS_iB2VpR6N0g53nug&s",
    "description": "Launched in 2020, the Mahindra Thar is an iconic off-roader that offers adventure and versatility. Its rugged design is built to withstand various terrains, making it suitable for thrill-seekers. Inside, the Thar features modern amenities while retaining its classic charm. With a powerful diesel engine and 4WD capabilities, it excels in off-road conditions while remaining comfortable for urban drives. The Thar is perfect for those who seek both adventure and practicality in their vehicle.",
    "specifications": ["Diesel Engine", "4-Seater", "Manual/Automatic Transmission", "4WD", "Removable Roof"]
  },
  {
    "id": "14",
    "brand": "Hyundai",
    "model": "i20",
    "price": 1200000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6CvqTh97SoVhHt477NC0lFTYV_ych1I_p8w&s",
    "description": "The Hyundai i20, launched in 2020, is a premium hatchback that combines style with advanced features. Its contemporary design and spacious interior make it a popular choice among young professionals. The i20 is equipped with high-tech features, enhancing connectivity and convenience. Safety is a top priority, with multiple airbags and advanced braking systems. With a strong performance and efficient engine, the i20 is perfect for those who value both aesthetics and functionality in city driving.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "6 Airbags"]
  },
  {
    "id": "15",
    "brand": "Tata",
    "model": "Nexon",
    "price": 1600000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQDy0coDxLTO6LnxySLbDhxru080Vr331Iu3w&s",
    "description": "The Tata Nexon, launched in 2017, is a compact SUV known for its safety and modern design. Its bold exterior is complemented by a well-designed interior that prioritizes comfort and technology. The Nexon features advanced safety features, including multiple airbags and a strong chassis design. With its strong performance and efficient engine, it is an excellent choice for families and urban dwellers alike, making it perfect for both city driving and weekend excursions.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Sunroof", "Dual Airbags"]
  },
  {
    "id": "16",
    "brand": "Kia",
    "model": "Carens",
    "price": 2200000,
    "fuelType": "Diesel",
    "seatingCapacity": 6,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSgMxx4QCR0lYsA3qEoNZhD5t8aWDs7ybTH5A&s",
    "description": "Launched in 2022, the Kia Carens is a versatile MPV that offers spacious seating and comfort for families. Its stylish design features ample legroom and modern technology, enhancing the travel experience for all passengers. The Carens is equipped with advanced safety features, including multiple airbags and stability control, ensuring a secure ride. With its reliable performance and spacious interiors, it is perfect for city driving and long trips, catering to families seeking comfort and convenience.",
    "specifications": ["Diesel Engine", "6-Seater", "Automatic Transmission", "Touchscreen Display", "Rear Parking Sensors"]
  },
  {
    "id": "17",
    "brand": "Honda",
    "model": "Amaze",
    "price": 1050000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://images.hindustantimes.com/auto/img/2024/04/08/1600x900/Honda_Amaze_1712549252524_1712549252767.jpeg",
    "description": "The Honda Amaze, launched in 2021, is a compact sedan that combines style with efficiency. Its sleek design and comfortable interior make it perfect for daily commutes. The Amaze is equipped with a fuel-efficient engine and advanced safety features, including multiple airbags, ensuring a secure and economical driving experience. With its practical design, the Amaze is an ideal choice for budget-conscious buyers seeking reliability and comfort in a compact package.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "Dual Airbags"]
  },
  {
    "id": "18",
    "brand": "Nissan",
    "model": "Magnite",
    "price": 1200000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://motoroctane.com/wp-content/uploads/2023/09/Untitled-design-2023-10-07T152610.882.jpg",
    "description": "The Nissan Magnite, launched in 2020, is a compact SUV that delivers style and performance. Its attractive design and spacious interiors make it a great option for urban drivers. The Magnite is packed with modern features, including a touchscreen infotainment system, enhancing the driving experience. With a range of safety features, including multiple airbags, it ensures peace of mind on the road. The Magnite is tailored for those who appreciate both aesthetics and practicality, making it a versatile choice for city driving.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "6 Airbags"]
  },
  {
    "id": "19",
    "brand": "Skoda",
    "model": "Slavia",
    "price": 1900000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://static.toiimg.com/thumb/msid-89887186,width-1280,height-720,resizemode-4/89887186.jpg",
    "description": "Launched in 2022, the Skoda Slavia is a premium sedan that combines elegance with performance. Its sophisticated design features a luxurious interior filled with advanced technology, catering to those who appreciate refinement. The Slavia prioritizes safety with multiple airbags and modern safety features. With its powerful engine and smooth handling, it is perfect for those who value a refined driving experience in both urban and highway settings.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Digital Cockpit", "6 Airbags"]
  },
  {
    "id": "20",
    "brand": "Volkswagen",
    "model": "Taigun",
    "price": 2000000,
    "fuelType": "Petrol",
    "seatingCapacity": 5,
    "image": "https://motoringworld.in/wp-content/uploads/2023/01/Volkswagen-Taigun-web-feature1.jpg",
    "description": "The Volkswagen Taigun, launched in 2021, is a stylish compact SUV designed for the modern driver. Its contemporary design features spacious interiors that offer comfort for both city and highway driving. Equipped with the latest technology and safety features, including multiple airbags, the Taigun ensures a secure and enjoyable ride. With its efficient engine and agile handling, it is perfect for those looking for a blend of style and functionality, making it an ideal choice for urban lifestyles.",
    "specifications": ["Petrol Engine", "5-Seater", "Manual/Automatic Transmission", "Touchscreen Display", "6 Airbags"]
  }
]